particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
/*
 * Copyright (c) 2019 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "logging.h"
LOG_SOURCE_CATEGORY("hal.ble")

#include "ble_hal.h"

#if HAL_PLATFORM_BLE
#define LOG_CHECKED_ERRORS 1

/* Headers included from nRF5_SDK/components/softdevice/s140/headers */
#include "ble.h"
#include "ble_gap.h"
#include "ble_gatt.h"
#include "ble_gatts.h"
#include "ble_gattc.h"
#include "ble_types.h"
/* Headers included from nRF5_SDK/components/softdevice/common */
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

#include "app_util.h"

#include "concurrent_hal.h"
#include "static_recursive_mutex.h"
#include <mutex>

#include "gpio_hal.h"
#include "device_code.h"
#include "nrf_system_error.h"
#include "sdk_config_system.h"
#include "spark_wiring_vector.h"
#include "simple_pool_allocator.h"
#include <string.h>
#include <memory>
#include "check_nrf.h"
#include "check.h"
#include "scope_guard.h"

using namespace particle;
#include "intrusive_list.h"

static_assert(NRF_SDH_BLE_PERIPHERAL_LINK_COUNT == 1, "Multiple simultaneous peripheral connections are not supported");
static_assert(NRF_SDH_BLE_TOTAL_LINK_COUNT <= 20, "Maximum supported number of concurrent connections in the peripheral and central roles combined exceeded");

using spark::Vector;
using namespace particle::ble;


//anonymous namespace
namespace {

StaticRecursiveMutex s_bleMutex;

const auto BLE_CONN_CFG_TAG = 1;

// BLE service base start handle.
const hal_ble_attr_handle_t SERVICES_BASE_START_HANDLE = 0x0001;
// BLE service top end handle.
const hal_ble_attr_handle_t SERVICES_TOP_END_HANDLE = 0xFFFF;

// Pool for storing scan result pure data.
const size_t OBSERVER_SCANNED_DATA_POOL_SIZE = 1024;
// Pool for scan result cached device.
const size_t OBSERVER_CACHED_DEVICE_POOL_SIZE = 1024;
// Pool for scan pending results.
const size_t OBSERVER_PENDING_RESULTS_POOL_SIZE = 1024;
// Pool for storing on-going connections.
const size_t CONNECTIONS_POOL_SIZE = 256;
// Pool for GATT Server to store received data.
const size_t GATT_SERVER_DATA_REC_POOL_SIZE = 1024;
// Pool for storing discovered service or characteristics.
const size_t GATT_CLIENT_DISC_SVC_CHAR_POOL_SIZE = 2048;
// Pool for GATT Client to store received data.
const size_t GATT_CLIENT_DATA_REC_POOL_SIZE = 1024;

// Timeout for GAP connection operation.
const uint32_t CONNECTION_OPERATION_TIMEOUT_MS = 5000;
// Timeout for sending notification/indication.
const uint32_t BLE_HVX_PROCEDURE_TIMEOUT_MS = 5000;
// Timeout for BLE service discovery procedure.
const uint32_t BLE_DICOVERY_PROCEDURE_TIMEOUT_MS = 10000;
// Timeout for data read write procedure.
const uint32_t BLE_READ_WRITE_PROCEDURE_TIMEOUT_MS = 5000;
// Delay for GATT Client to send the ATT MTU exchanging request.
const uint32_t BLE_ATT_MTU_EXCHANGE_DELAY_MS = 800;

static const uint8_t BleAdvEvtTypeMap[] = {
    BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED,
    BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED,
    BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED,
    BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED,
    BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_NONSCANNABLE_DIRECTED,
    BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED,
    BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_SCANNABLE_DIRECTED
};

bool addressEqual(const hal_ble_addr_t& srcAddr, const hal_ble_addr_t& destAddr) {
    return (srcAddr.addr_type == destAddr.addr_type && !memcmp(srcAddr.addr, destAddr.addr, BLE_SIG_ADDR_LEN));
}

hal_ble_addr_t chipDefaultAddress() {
    uint32_t addrMsb = NRF_FICR->DEVICEID[1];
    uint32_t addrLsb = NRF_FICR->DEVICEID[0];
    hal_ble_addr_t localAddr = {};
    localAddr.addr_type = BLE_SIG_ADDR_TYPE_RANDOM_STATIC;
    localAddr.addr[0] = (uint8_t)((addrMsb >> 24) & 0x000000FF);
    localAddr.addr[1] = (uint8_t)((addrMsb >> 16) & 0x000000FF);
    localAddr.addr[2] = (uint8_t)((addrMsb >> 8) & 0x000000FF);
    localAddr.addr[3] = (uint8_t)(addrMsb & 0x000000FF);
    localAddr.addr[4] = (uint8_t)((addrLsb >> 24) & 0x000000FF);
    localAddr.addr[5] = (uint8_t)((addrLsb >> 16) & 0x000000FF);
    return localAddr;
}

} //anonymous namespace

class GattBase {
public:
    GattBase() = default;
    ~GattBase() = default;

protected:
    static uint8_t toHalCharProps(ble_gatt_char_props_t properties) {
        uint8_t halProperties = 0;
        if (properties.broadcast) {
            halProperties |= BLE_SIG_CHAR_PROP_BROADCAST;
        }
        if (properties.read) {
            halProperties |= BLE_SIG_CHAR_PROP_READ;
        }
        if (properties.write_wo_resp) {
            halProperties |= BLE_SIG_CHAR_PROP_WRITE_WO_RESP;
        }
        if (properties.write) {
            halProperties |= BLE_SIG_CHAR_PROP_WRITE;
        }
        if (properties.notify){
            halProperties |= BLE_SIG_CHAR_PROP_NOTIFY;
        }
        if (properties.indicate) {
            halProperties |= BLE_SIG_CHAR_PROP_INDICATE;
        }
        if (properties.auth_signed_wr) {
            halProperties |= BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES;
        }
        return halProperties;
    }

    static ble_gatt_char_props_t toPlatformCharProps(uint8_t halProperties) {
        ble_gatt_char_props_t properties = {};
        properties.broadcast = (halProperties & BLE_SIG_CHAR_PROP_BROADCAST) ? 1 : 0;
        properties.read = (halProperties & BLE_SIG_CHAR_PROP_READ) ? 1 : 0;
        properties.write_wo_resp = (halProperties & BLE_SIG_CHAR_PROP_WRITE_WO_RESP) ? 1 : 0;
        properties.write = (halProperties & BLE_SIG_CHAR_PROP_WRITE) ? 1 : 0;
        properties.notify = (halProperties & BLE_SIG_CHAR_PROP_NOTIFY) ? 1 : 0;
        properties.indicate = (halProperties & BLE_SIG_CHAR_PROP_INDICATE) ? 1 : 0;
        properties.auth_signed_wr = (halProperties & BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES) ? 1 : 0;
        return properties;
    }
};

class BleObject {
public:
    class BleEventDispatcher;
    class BleGap;
    class Broadcaster;
    class Observer;
    class ConnectionsManager;
    class GattServer;
    class GattClient;

    static BleObject& getInstance();
    int init();
    bool initialized() const;
    int selectAntenna(hal_ble_ant_type_t antenna) const;

    BleEventDispatcher* dispatcher() { return dispatcher_.get(); }
    BleGap* gap() { return gap_.get(); }
    Broadcaster* broadcaster() { return broadcaster_.get(); }
    Observer* observer() { return observer_.get(); }
    ConnectionsManager* connMgr() { return connectionsMgr_.get(); }
    GattServer* gatts() { return gatts_.get(); }
    GattClient* gattc() { return gattc_.get(); }

