particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::Observer::stopScanning() {
    if (!isScanning_) {
        return SYSTEM_ERROR_NONE;
    }
    int ret = sd_ble_gap_scan_stop();
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    if (scanSemaphore_) {
        os_semaphore_give(scanSemaphore_, false);
    }
    return SYSTEM_ERROR_NONE;
}

ble_gap_scan_params_t BleObject::Observer::toPlatformScanParams() const {
    ble_gap_scan_params_t params = {};
    params.extended = 0;
    params.active = scanParams_.active;
    params.interval = scanParams_.interval;
    params.window = scanParams_.window;
    params.timeout = scanParams_.timeout;
    params.scan_phys = BLE_GAP_PHY_1MBPS;
    params.filter_policy = scanParams_.filter_policy;
    return params;
}

bool BleObject::Observer::isCachedDevice(const hal_ble_addr_t& address) const {
    auto device = cachedDevicesList_.front();
    while (device) {
        if (addressEqual(device->addr, address)) {
            return true;
        }
        device = device->next;
    }
    return false;
}

int BleObject::Observer::addCachedDevice(const hal_ble_addr_t& address) {
    CachedDevice* device = (CachedDevice*)scanCacheDevicesPool_.alloc(sizeof(CachedDevice));
    if (device) {
        device->addr = address;
        cachedDevicesList_.pushFront(device);
        return SYSTEM_ERROR_NONE;
    } else {
        LOG(ERROR, "Allocate memory for cached device failed.");
    }
    return SYSTEM_ERROR_NO_MEMORY;
}

void BleObject::Observer::clearCachedDevice() {
    CachedDevice* device = nullptr;
    do {
        device = cachedDevicesList_.popFront();
        if (device) {
            CachedDevice* curr = device;
            scanCacheDevicesPool_.free(curr);
        }
    } while (device);
}

hal_ble_gap_on_scan_result_evt_t* BleObject::Observer::getPendingResult(const hal_ble_addr_t& address) {
    auto result = pendingResultsList_.front();
    while (result) {
        if (addressEqual(result->resultEvt.peer_addr, address)) {
            return &result->resultEvt;
        }
        result = result->next;
    }
    return nullptr;
}

int BleObject::Observer::addPendingResult(const hal_ble_gap_on_scan_result_evt_t& resultEvt) {
    PendingResult* result = (PendingResult*)scanPendingResultsPool_.alloc(sizeof(PendingResult));
    if (result) {
        memcpy(&result->resultEvt, &resultEvt, sizeof(hal_ble_gap_on_scan_result_evt_t));
        pendingResultsList_.pushFront(result);
        return SYSTEM_ERROR_NONE;
    } else {
        LOG(ERROR, "Allocate memory for pending result failed.");
    }
    return SYSTEM_ERROR_NO_MEMORY;
}

void BleObject::Observer::removePendingResult(const hal_ble_addr_t& address) {
    auto result = pendingResultsList_.front();
    PendingResult* prev = nullptr;
    while (result) {
        if (addressEqual(result->resultEvt.peer_addr, address)) {
            PendingResult* curr = pendingResultsList_.pop(result, prev);
            result = curr->next;
            scanPendingResultsPool_.free(curr);
            continue;
        }
        prev = result;
        result = result->next;
    }
}

void BleObject::Observer::clearPendingResult() {
    PendingResult* result = nullptr;
    do {
        result = pendingResultsList_.popFront();
        if (result) {
            if (result->resultEvt.adv_data != nullptr) {
                observerScannedDataPool_.free(result->resultEvt.adv_data);
                //LOG_DEBUG(TRACE, "clearPendingResult: Free Scanned adv_data memory: %u", (unsigned)result->resultEvt.adv_data);
            }
            PendingResult* curr = result;
            scanPendingResultsPool_.free(curr);
        }
    } while (result);
}

void BleObject::Observer::observerEventProcessedHook(const hal_ble_evts_t *event, void* context) {
    Observer* observer = static_cast<Observer*>(context);
    if (observer && event && event->type == BLE_EVT_SCAN_RESULT) {
        if (event->params.scan_result.adv_data != nullptr) {
            observer->observerScannedDataPool_.free(event->params.scan_result.adv_data);
            //LOG_DEBUG(TRACE, "Hook: Free Scanned adv_data memory: %u", (unsigned)event->params.scan_result.adv_data);
        }
        if (event->params.scan_result.sr_data != nullptr) {
            observer->observerScannedDataPool_.free(event->params.scan_result.sr_data);
            //LOG_DEBUG(TRACE, "Hook: Free Scanned sr_data memory: %u", (unsigned)event->params.scan_result.sr_data);
        }
    }
}

void BleObject::Observer::processObserverEvents(const ble_evt_t* event, void* context) {
    Observer* observer = static_cast<ObserverImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_ADV_REPORT: {
            const ble_gap_evt_adv_report_t& advReport = event->evt.gap_evt.params.adv_report;
            hal_ble_addr_t newAddr;
            newAddr.addr_type = (ble_sig_addr_type_t)advReport.peer_addr.addr_type;
            memcpy(newAddr.addr, advReport.peer_addr.addr, BLE_SIG_ADDR_LEN);
            if (!observer->isCachedDevice(newAddr)) {
                if (!observer->scanParams_.active || !advReport.type.scannable) {
                    if (observer->addCachedDevice(newAddr) != SYSTEM_ERROR_NONE) {
                        return;
                    }
                    uint8_t* advData = (uint8_t*)observer->observerScannedDataPool_.alloc(advReport.data.len);
                    if (advData) {
                        //LOG_DEBUG(TRACE, "Scanned adv_data address: %u, len: %u", (unsigned)advData, advReport.data.len);
                        BleObject::BleEventDispatcher::EventMessage msg;
                        msg.evt.type = BLE_EVT_SCAN_RESULT;
                        msg.evt.version = BLE_API_VERSION;
                        msg.evt.size = sizeof(hal_ble_evts_t);
                        msg.evt.params.scan_result.type.connectable = advReport.type.connectable;
                        msg.evt.params.scan_result.type.scannable = advReport.type.scannable;
                        msg.evt.params.scan_result.type.directed = advReport.type.directed;
                        msg.evt.params.scan_result.type.extended_pdu = advReport.type.extended_pdu;
                        msg.evt.params.scan_result.rssi = advReport.rssi;
                        msg.evt.params.scan_result.peer_addr.addr_type = (ble_sig_addr_type_t)advReport.peer_addr.addr_type;
                        memcpy(msg.evt.params.scan_result.peer_addr.addr, advReport.peer_addr.addr, BLE_SIG_ADDR_LEN);
                        msg.evt.params.scan_result.adv_data_len = advReport.data.len;
                        memcpy(advData, advReport.data.p_data, advReport.data.len);
                        msg.evt.params.scan_result.adv_data = advData;
                        msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)observer->scanResultCallBack_;
                        msg.context = observer->context_;
                        msg.hook = observer->observerEventProcessedHook;
                        msg.hookContext = observer;
                        BleObject::getInstance().dispatcher()->enqueue(msg);
                    } else {
                        LOG(ERROR, "Allocate memory for scanned advertising data failed.");
                    }
                } else if (advReport.type.scannable) {
                    if (!advReport.type.scan_response) {
                        if (observer->getPendingResult(newAddr) == nullptr) {
                            uint8_t* advData = (uint8_t*)observer->observerScannedDataPool_.alloc(advReport.data.len);
                            if (advData) {
                                //LOG_DEBUG(TRACE, "Cached adv_data address: %u, len: %u", (unsigned)advData, advReport.data.len);
                                hal_ble_gap_on_scan_result_evt_t result = {};
                                result.type.connectable = advReport.type.connectable;
                                result.type.scannable = advReport.type.scannable;
                                result.type.directed = advReport.type.directed;
                                result.type.extended_pdu = advReport.type.extended_pdu;
                                result.rssi = advReport.rssi;
                                result.peer_addr.addr_type = newAddr.addr_type;
                                memcpy(result.peer_addr.addr, newAddr.addr, BLE_SIG_ADDR_LEN);
                                result.adv_data_len = advReport.data.len;
                                memcpy(advData, advReport.data.p_data, advReport.data.len);
                                result.adv_data = advData;
                                observer->addPendingResult(result);
                            } else {
                                LOG(ERROR, "Allocate memory for scanned advertising data failed.");
                            }
                        }
                    } else {
                        hal_ble_gap_on_scan_result_evt_t* result = observer->getPendingResult(newAddr);
                        if (result) {
                            result->rssi = advReport.rssi;
                            result->sr_data = nullptr;
                            result->sr_data_len = advReport.data.len;
                            if (advReport.data.len > 0) {
                                uint8_t* srData = (uint8_t*)observer->observerScannedDataPool_.alloc(advReport.data.len);
                                if (srData) {
                                    //LOG_DEBUG(TRACE, "Scanned sr_data address: %u, len: %u", (unsigned)srData, advReport.data.len);
                                    memcpy(srData, advReport.data.p_data, advReport.data.len);
                                    result->sr_data = srData;
                                } else {
                                    LOG(ERROR, "Allocate memory for scan response data failed.");
                                    result->sr_data_len = 0;
                                }
                            }
                            observer->removePendingResult(newAddr);
                            if (observer->addCachedDevice(newAddr) != SYSTEM_ERROR_NONE) {
                                return;
                            }
                            BleObject::BleEventDispatcher::EventMessage msg;
                            msg.evt.type = BLE_EVT_SCAN_RESULT;
                            msg.evt.params.scan_result = *result;
                            msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)observer->scanResultCallBack_;
                            msg.context = observer->context_;
                            msg.hook = observer->observerEventProcessedHook;
                            msg.hookContext = observer;
                            BleObject::getInstance().dispatcher()->enqueue(msg);
                        }
                    }
                }
            }
            // Continue scanning
            observer->continueScanning();
            break;
        }
        case BLE_GAP_EVT_TIMEOUT: {
            if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN) {
                LOG_DEBUG(TRACE, "BLE GAP event: Scanning timeout");
                if (observer->scanSemaphore_) {
                    os_semaphore_give(observer->scanSemaphore_, false);
                }
            }
            break;
        }
        default: {
            break;
        }
    }
}

