particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::ConnectionsManager::disconnect(hal_ble_conn_handle_t connHandle) {
    if (fetchConnection(connHandle) == nullptr) {
        return SYSTEM_ERROR_NOT_FOUND;
    }
    if (os_semaphore_create(&disconnectSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD ({
        disconnectingHandle_ = BLE_INVALID_CONN_HANDLE;
        auto sem = disconnectSemaphore_;
        disconnectSemaphore_ = nullptr;
        os_semaphore_destroy(sem);
    });
    int ret = sd_ble_gap_disconnect(connHandle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    disconnectingHandle_ = connHandle;
    if (os_semaphore_take(disconnectSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
        return SYSTEM_ERROR_TIMEOUT;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::disconnectAll() {
    BleConnection* connection = nullptr;
    do {
        connection = connectionsList_.popFront();
        if (connection) {
            disconnect(connection->connHandle);
            BleConnection* curr = connection;
            connectionsPool_.free(curr);
        }
    } while (connection);
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::updateConnectionParams(hal_ble_conn_handle_t connHandle, const hal_ble_conn_params_t* params) {
    int ret;
    if (fetchConnection(connHandle) == nullptr) {
        return SYSTEM_ERROR_NOT_FOUND;
    }
    if (os_semaphore_create(&connParamsUpdateSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD ({
        connParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
        auto sem = connParamsUpdateSemaphore_;
        connParamsUpdateSemaphore_ = nullptr;
        os_semaphore_destroy(sem);
    });
    ble_gap_conn_params_t bleGapConnParams = {};
    if (params == nullptr) {
        // Use the PPCP characteristic value as the connection parameters.
        ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
        CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    } else {
        bleGapConnParams = toPlatformConnParams(params);
    }
    // For Central role, this will initiate the connection parameter update procedure.
    // For Peripheral role, this will use the passed in parameters and send the request to central.
    ret = sd_ble_gap_conn_param_update(connHandle, &bleGapConnParams);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    connParamUpdateHandle_ = connHandle;
    if (os_semaphore_take(connParamsUpdateSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
        return SYSTEM_ERROR_TIMEOUT;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::getConnectionParams(hal_ble_conn_handle_t connHandle, hal_ble_conn_params_t* params) {
    const BleConnection* connection = fetchConnection(connHandle);
    if (connection == nullptr) {
        return SYSTEM_ERROR_NOT_FOUND;
    }
    memcpy(params, &connection->effectiveConnParams, std::min(params->size, connection->effectiveConnParams.size));
    return SYSTEM_ERROR_NONE;
}

bool BleObject::ConnectionsManager::valid(hal_ble_conn_handle_t connHandle) {
    const BleConnection* connection = fetchConnection(connHandle);
    return connection != nullptr;
}

ble_gap_conn_params_t BleObject::ConnectionsManager::toPlatformConnParams(const hal_ble_conn_params_t* halConnParams) {
    ble_gap_conn_params_t params = {};
    params.min_conn_interval = halConnParams->min_conn_interval;
    params.max_conn_interval = halConnParams->max_conn_interval;
    params.slave_latency = halConnParams->slave_latency;
    params.conn_sup_timeout = halConnParams->conn_sup_timeout;
    return params;
}

hal_ble_conn_params_t BleObject::ConnectionsManager::toHalConnParams(const ble_gap_conn_params_t* params) {
    hal_ble_conn_params_t halConnParams = {};
    halConnParams.version = BLE_API_VERSION;
    halConnParams.size = sizeof(hal_ble_conn_params_t);
    halConnParams.min_conn_interval = params->min_conn_interval;
    halConnParams.max_conn_interval = params->max_conn_interval;
    halConnParams.slave_latency = params->slave_latency;
    halConnParams.conn_sup_timeout = params->conn_sup_timeout;
    return halConnParams;
}

ssize_t BleObject::ConnectionsManager::getAttMtu(hal_ble_conn_handle_t connHandle) {
    const auto connection = fetchConnection(connHandle);
    if (connection) {
        return connection->effectiveMtu;
    }
    return SYSTEM_ERROR_NOT_FOUND;
}

int BleObject::ConnectionsManager::configureAttMtu(hal_ble_conn_handle_t connHandle, size_t effective) {
    auto connection = fetchConnection(connHandle);
    if (connection) {
        connection->effectiveMtu = effective;
        connection->isMtuExchanged = true;
        return SYSTEM_ERROR_NONE;
    }
    return SYSTEM_ERROR_NOT_FOUND;
}

bool BleObject::ConnectionsManager::attMtuExchanged(hal_ble_conn_handle_t connHandle) {
    const auto connection = fetchConnection(connHandle);
    if (connection) {
        return connection->isMtuExchanged;
    }
    return false;
}

BleObject::ConnectionsManager::BleConnection* BleObject::ConnectionsManager::fetchConnection(hal_ble_conn_handle_t connHandle) {
    if (connHandle == BLE_INVALID_CONN_HANDLE) {
        return nullptr;
    }
    auto connection = connectionsList_.front();
    while (connection) {
        if (connection->connHandle == connHandle) {
            return connection;
        }
        connection = connection->next;
    }
    return nullptr;
}

BleObject::ConnectionsManager::BleConnection* BleObject::ConnectionsManager::fetchConnection(const hal_ble_addr_t* address) {
    if (address == nullptr) {
        return nullptr;
    }
    auto connection = connectionsList_.front();
    while (connection) {
        if (addressEqual(connection->peer, *address)) {
            return connection;
        }
        connection = connection->next;
    }
    return nullptr;
}

int BleObject::ConnectionsManager::addConnection(const BleConnection& connection) {
    removeConnection(connection.connHandle);
    BleConnection* conn = (BleConnection*)connectionsPool_.alloc(sizeof(BleConnection));
    if (conn) {
        *conn = connection;
        connectionsList_.pushFront(conn);
        return SYSTEM_ERROR_NONE;
    } else {
        LOG(ERROR, "Allocate memory for new connection failed.");
    }
    return SYSTEM_ERROR_NO_MEMORY;
}

void BleObject::ConnectionsManager::removeConnection(hal_ble_conn_handle_t connHandle) {
    auto connection = connectionsList_.front();
    BleConnection* prev = nullptr;
    while (connection) {
        if (connection->connHandle == connHandle) {
            BleConnection* curr = connectionsList_.pop(connection, prev);
            connection = curr->next;
            connectionsPool_.free(curr);
            continue;
        }
        prev = connection;
        connection = connection->next;
    }
}

void BleObject::ConnectionsManager::initiateConnParamsUpdateIfNeeded(const BleConnection* connection) {
    if (connParamsUpdateTimer_ == nullptr) {
        return;
    }
    if (!isConnParamsFeeded(&connection->effectiveConnParams)) {
        if (connParamsUpdateAttempts_ < BLE_CONN_PARAMS_UPDATE_ATTEMPS) {
            if (!os_timer_change(connParamsUpdateTimer_, OS_TIMER_CHANGE_START, true, 0, 0, nullptr)) {
                LOG_DEBUG(TRACE, "Attempts to update BLE connection parameters, try: %d after %d ms",
                        connParamsUpdateAttempts_, BLE_CONN_PARAMS_UPDATE_DELAY_MS);
                connParamUpdateHandle_ = connection->connHandle;
                return;
            }
        } else {
            int ret = sd_ble_gap_disconnect(connection->connHandle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
            if (ret != NRF_SUCCESS) {
                LOG_DEBUG(TRACE, "sd_ble_gap_disconnect() failed: %d", ret);
                return;
            }
            LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
        }
    }
}

bool BleObject::ConnectionsManager::isConnParamsFeeded(const hal_ble_conn_params_t* params) const {
    hal_ble_conn_params_t ppcp = {};
    if (getPpcp(&ppcp) == SYSTEM_ERROR_NONE) {
        uint16_t minAcceptedSl = ppcp.slave_latency - std::min((uint16_t)BLE_CONN_PARAMS_SLAVE_LATENCY_ERR, ppcp.slave_latency);
        uint16_t maxAcceptedSl = ppcp.slave_latency + BLE_CONN_PARAMS_SLAVE_LATENCY_ERR;
        uint16_t minAcceptedTo = ppcp.conn_sup_timeout - std::min((uint16_t)BLE_CONN_PARAMS_TIMEOUT_ERR, ppcp.conn_sup_timeout);
        uint16_t maxAcceptedTo = ppcp.conn_sup_timeout + BLE_CONN_PARAMS_TIMEOUT_ERR;
        if (params->max_conn_interval < ppcp.min_conn_interval ||
                params->max_conn_interval > ppcp.max_conn_interval) {
            return false;
        }
        if (params->slave_latency < minAcceptedSl ||
                params->slave_latency > maxAcceptedSl) {
            return false;
        }
        if (params->conn_sup_timeout < minAcceptedTo ||
                params->conn_sup_timeout > maxAcceptedTo) {
            return false;
        }
    }
    return true;
}

