particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::GattServer::init() {
    CHECK(gattsDataRecPool_.init(GATT_SERVER_DATA_REC_POOL_SIZE));
    gattsImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleGattServer, 1, processGattServerEvents, &gattsImpl);
    gattsInitialized_ = true;
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattServer::addService(uint8_t type, const hal_ble_uuid_t* uuid, hal_ble_attr_handle_t* svcHandle) {
    ble_uuid_t svcUuid;
    if (uuid == nullptr || svcHandle == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    int ret;
    CHECK(BleObject::toPlatformUUID(uuid, &svcUuid));
    ret = sd_ble_gatts_service_add(type, &svcUuid, svcHandle);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    services_.append(*svcHandle);
    LOG_DEBUG(TRACE, "Service handle: %d.", *svcHandle);
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattServer::addCharacteristic(hal_ble_attr_handle_t svcHandle, uint8_t properties, const hal_ble_uuid_t* uuid, const char* desc, hal_ble_char_handles_t* charHandles) {
    if (charHandles == nullptr || uuid == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (characteristics_.size() >= BLE_MAX_CHAR_COUNT) {
        return SYSTEM_ERROR_LIMIT_EXCEEDED;
    }
    if (findService(svcHandle)) {
        ble_uuid_t charUuid;
        ble_gatts_char_md_t charMd = {};
        ble_gatts_attr_md_t valueAttrMd = {};
        ble_gatts_attr_md_t userDescAttrMd = {};
        ble_gatts_attr_md_t cccdAttrMd = {};
        ble_gatts_attr_t charValueAttr = {};
        ble_gatts_char_handles_t handles = {};
        int ret;
        CHECK(BleObject::toPlatformUUID(uuid, &charUuid));
        charMd.char_props = {};
        charMd.char_props = toPlatformCharProps(properties);
        // User Description Descriptor attribute metadata
        if (desc != nullptr) {
            BLE_GAP_CONN_SEC_MODE_SET_OPEN(&userDescAttrMd.read_perm);
            BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&userDescAttrMd.write_perm);
            userDescAttrMd.vloc = BLE_GATTS_VLOC_STACK;
            userDescAttrMd.rd_auth = 0;
            userDescAttrMd.wr_auth = 0;
            userDescAttrMd.vlen = 0;
            charMd.p_char_user_desc = (const uint8_t *)desc;
            charMd.char_user_desc_max_size = strlen(desc);
            charMd.char_user_desc_size = strlen(desc);
            charMd.p_user_desc_md = &userDescAttrMd;
        } else {
            charMd.p_char_user_desc = nullptr;
            charMd.p_user_desc_md = nullptr;
        }
        // Client Characteristic Configuration Descriptor attribute metadata
        if (charMd.char_props.notify || charMd.char_props.indicate) {
            BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdAttrMd.read_perm);
            BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdAttrMd.write_perm);
            cccdAttrMd.vloc = BLE_GATTS_VLOC_STACK;
            charMd.p_cccd_md = &cccdAttrMd;
        }
        // TODO:
        charMd.p_char_pf = nullptr;
        charMd.p_sccd_md = nullptr;
        // Characteristic value attribute metadata
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&valueAttrMd.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&valueAttrMd.write_perm);
        valueAttrMd.vloc = BLE_GATTS_VLOC_USER;
        valueAttrMd.rd_auth = 0;
        valueAttrMd.wr_auth = 0;
        valueAttrMd.vlen = 1;
        // Characteristic value attribute
        uint8_t* charValue = (uint8_t*)malloc(BLE_MAX_ATTR_VALUE_PACKET_SIZE);
        CHECK_TRUE(charValue, SYSTEM_ERROR_NO_MEMORY);
        charValueAttr.p_uuid = &charUuid;
        charValueAttr.p_attr_md = &valueAttrMd;
        charValueAttr.init_len = 0;
        charValueAttr.init_offs = 0;
        charValueAttr.max_len = BLE_MAX_ATTR_VALUE_PACKET_SIZE;
        charValueAttr.p_value = charValue;
        ret = sd_ble_gatts_characteristic_add(svcHandle, &charMd, &charValueAttr, &handles);
        if (ret != NRF_SUCCESS) {
            free(charValue);
            CHECK_NRF_RETURN(ret, nrf_system_error(ret));
        }
        BleCharacteristic characteristic;
        characteristic.properties = properties;
        characteristic.svcHandle = svcHandle;
        characteristic.charHandles.size = sizeof(hal_ble_char_handles_t);
        characteristic.charHandles.decl_handle = handles.value_handle - 1;
        characteristic.charHandles.value_handle = handles.value_handle;
        characteristic.charHandles.user_desc_handle = handles.user_desc_handle;
        characteristic.charHandles.cccd_handle = handles.cccd_handle;
        characteristic.charHandles.sccd_handle = handles.sccd_handle;
        characteristics_.append(characteristic);
        *charHandles = characteristic.charHandles;
        LOG_DEBUG(TRACE, "Characteristic value handle: %d.", handles.value_handle);
        LOG_DEBUG(TRACE, "Characteristic cccd handle: %d.", handles.cccd_handle);
        return SYSTEM_ERROR_NONE;
    }
    else {
        return SYSTEM_ERROR_NOT_FOUND;
    }
}

int BleObject::GattServer::addDescriptor(hal_ble_attr_handle_t charHandle, const hal_ble_uuid_t* uuid, uint8_t* descriptor, size_t len, hal_ble_attr_handle_t* descHandle) {
    if (uuid == nullptr || descriptor== nullptr || descHandle == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (findCharacteristic(charHandle)) {
        ble_gatts_attr_t descAttr = {};
        ble_gatts_attr_md_t descAttrMd = {};
        ble_uuid_t descUuid;
        int ret;
        CHECK(BleObject::toPlatformUUID(uuid, &descUuid));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&descAttrMd.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&descAttrMd.write_perm);
        descAttrMd.vloc = BLE_GATTS_VLOC_STACK;
        descAttrMd.rd_auth = 0;
        descAttrMd.wr_auth = 0;
        descAttrMd.vlen    = 0;
        descAttr.p_uuid    = &descUuid;
        descAttr.p_attr_md = &descAttrMd;
        descAttr.init_len  = len;
        descAttr.init_offs = 0;
        descAttr.max_len   = len;
        descAttr.p_value   = descriptor;
        // FIXME: validate the descriptor to be added
        ret = sd_ble_gatts_descriptor_add(charHandle, &descAttr, descHandle);
        // TODO: assigne the handle to corresponding characteristic.
        return nrf_system_error(ret);
    }
    else {
        return SYSTEM_ERROR_NOT_FOUND;
    }
}

ssize_t BleObject::GattServer::setValue(hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len) {
    if (attrHandle == BLE_INVALID_ATTR_HANDLE || buf == nullptr || len == 0) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    BleCharacteristic* characteristic = findCharacteristic(attrHandle);
    if (characteristic != nullptr && attrHandle == characteristic->charHandles.value_handle) {
        len = std::min(len, (size_t)BLE_MAX_ATTR_VALUE_PACKET_SIZE);
        ble_gatts_value_t gattValue = {};
        gattValue.len = len;
        gattValue.offset = 0;
        gattValue.p_value = (uint8_t*)buf;
        int ret = sd_ble_gatts_value_set(BLE_CONN_HANDLE_INVALID, attrHandle, &gattValue);
        CHECK_NRF_RETURN(ret, nrf_system_error(ret));
        // Notify or indicate the value if possible.
        if ((characteristic->properties & BLE_SIG_CHAR_PROP_NOTIFY) || (characteristic->properties & BLE_SIG_CHAR_PROP_INDICATE)) {
            for (const auto& cccdConnection : characteristic->cccdConnections) {
                if (cccdConnection != BLE_INVALID_CONN_HANDLE) {
                    if (os_semaphore_create(&hvxSemaphore_, 1, 0)) {
                        LOG(ERROR, "os_semaphore_create() failed");
                        break;
                    }
                    SCOPE_GUARD ({
                        auto sem = hvxSemaphore_;
                        hvxSemaphore_ = nullptr;
                        os_semaphore_destroy(sem);
                    });
                    ble_gatts_hvx_params_t hvxParams = {};
                    uint16_t hvxLen = std::min(len, (size_t)BLE_ATTR_VALUE_PACKET_SIZE(BleObject::getInstance().connMgr()->getAttMtu(cccdConnection)));
                    LOG_DEBUG(TRACE, "Notify data len: %d", hvxLen);
                    if (characteristic->properties & BLE_SIG_CHAR_PROP_NOTIFY) {
                        hvxParams.type = BLE_GATT_HVX_NOTIFICATION;
                    } else if (characteristic->properties & BLE_SIG_CHAR_PROP_INDICATE) {
                        hvxParams.type = BLE_GATT_HVX_INDICATION;
                    }
                    hvxParams.handle = attrHandle;
                    hvxParams.offset = 0;
                    hvxParams.p_data = buf;
                    hvxParams.p_len = &hvxLen;
                    ret_code_t ret = sd_ble_gatts_hvx(cccdConnection, &hvxParams);
                    if (ret != NRF_SUCCESS) {
                        LOG(ERROR, "sd_ble_gatts_hvx() failed: %u", (unsigned)ret);
                        break;
                    }
                    if (os_semaphore_take(hvxSemaphore_, BLE_HVX_PROCEDURE_TIMEOUT_MS, false)) {
                        break;
                    }
                }
            }
        }
        return len;
    }
    else {
        return SYSTEM_ERROR_NOT_FOUND;
    }
}

ssize_t BleObject::GattServer::getValue(hal_ble_attr_handle_t attrHandle, uint8_t* buf, size_t len) {
    if (attrHandle == BLE_INVALID_ATTR_HANDLE || buf == nullptr || len == 0) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    BleCharacteristic* characteristic = findCharacteristic(attrHandle);
    if (characteristic != nullptr && attrHandle == characteristic->charHandles.value_handle) {
        len = std::min(len, (size_t)BLE_MAX_ATTR_VALUE_PACKET_SIZE);
        ble_gatts_value_t gattValue;
        gattValue.len = len;
        gattValue.offset = 0;
        gattValue.p_value = buf;
        int ret = sd_ble_gatts_value_get(BLE_CONN_HANDLE_INVALID, attrHandle, &gattValue);
        CHECK_NRF_RETURN(ret, nrf_system_error(ret));
        return gattValue.len;
    } else {
        return SYSTEM_ERROR_NOT_FOUND;
    }
}

bool BleObject::GattServer::findService(hal_ble_attr_handle_t svcHandle) const {
    for (const auto& handle : services_) {
        if (handle == svcHandle) {
            return true;
        }
    }
    return false;
}

BleObject::GattServer::BleCharacteristic* BleObject::GattServer::findCharacteristic(hal_ble_attr_handle_t attrHandle) {
    for (auto& characteristic : characteristics_) {
        if (characteristic.charHandles.value_handle == attrHandle ||
                characteristic.charHandles.decl_handle == attrHandle ||
                characteristic.charHandles.user_desc_handle == attrHandle ||
                characteristic.charHandles.cccd_handle == attrHandle ||
                characteristic.charHandles.sccd_handle == attrHandle) {
            return &characteristic;
        }
    }
    return nullptr;
}

void BleObject::GattServer::addToCccdList(BleCharacteristic* characteristic, hal_ble_conn_handle_t connHandle) {
    for (auto& cccdConnection : characteristic->cccdConnections) {
        if (cccdConnection == BLE_INVALID_CONN_HANDLE) {
            cccdConnection = connHandle;
            return;
        }
    }
}

void BleObject::GattServer::removeFromCCCDList(BleCharacteristic* characteristic, hal_ble_conn_handle_t connHandle) {
    for (auto& cccdConnection : characteristic->cccdConnections) {
        if (cccdConnection == connHandle) {
            cccdConnection = BLE_INVALID_CONN_HANDLE;
        }
    }
}

void BleObject::GattServer::removeFromAllCCCDList(hal_ble_conn_handle_t connHandle) {
    for (auto& characteristic : characteristics_) {
        removeFromCCCDList(&characteristic, connHandle);
    }
}

void BleObject::GattServer::gattsEventProcessedHook(const hal_ble_evts_t *event, void* context) {
    GattServer* gatts = static_cast<GattServer*>(context);
    if (gatts && event && event->type == BLE_EVT_DATA_WRITTEN) {
        if (event->params.data_rec.data != nullptr) {
            gatts->gattsDataRecPool_.free(event->params.data_rec.data);
            //LOG_DEBUG(TRACE, "Free received data memory: %u", (unsigned)event->params.data_rec.data);
        }
    }
}

void BleObject::GattServer::processGattServerEvents(const ble_evt_t* event, void* context) {
    GattServer* gatts = static_cast<GattServerImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_DISCONNECTED: {
            gatts->removeFromAllCCCDList(event->evt.gap_evt.conn_handle);
            break;
        }
        case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: system attribute is missing.");
            // No persistent system attributes
            const uint32_t ret = sd_ble_gatts_sys_attr_set(event->evt.gatts_evt.conn_handle, nullptr, 0, 0);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_sys_attr_set() failed: %u", (unsigned)ret);
            }
            break;
        }
        case BLE_GATTS_EVT_WRITE: {
            const ble_gatts_evt_write_t& write = event->evt.gatts_evt.params.write;
            LOG_DEBUG(TRACE, "BLE GATT Server event: write characteristic, handle: %d", write.handle);
            BleCharacteristic* characteristic = gatts->findCharacteristic(write.handle);
            if (characteristic != nullptr) {
                if (characteristic->charHandles.cccd_handle == write.handle) {
                    if (event->evt.gatts_evt.params.write.data[0] > 0) {
                        gatts->addToCccdList(characteristic, event->evt.gatts_evt.conn_handle);
                    } else {
                        gatts->removeFromCCCDList(characteristic, event->evt.gatts_evt.conn_handle);
                    }
                }
                // TODO: deal with different write commands.
                uint8_t* data = (uint8_t*)gatts->gattsDataRecPool_.alloc(write.len);
                if (data) {
                    //LOG_DEBUG(TRACE, "Received data address: %u, len: %u", (unsigned)data, write.len);
                    BleObject::BleEventDispatcher::EventMessage msg;
                    msg.evt.type = BLE_EVT_DATA_WRITTEN;
                    msg.evt.version = BLE_API_VERSION;
                    msg.evt.size = sizeof(hal_ble_evts_t);
                    msg.evt.params.data_rec.conn_handle = event->evt.gatts_evt.conn_handle;
                    msg.evt.params.data_rec.attr_handle = write.handle;
                    msg.evt.params.data_rec.offset = write.offset;
                    msg.evt.params.data_rec.data_len = write.len;
                    memcpy(data, write.data, write.len);
                    msg.evt.params.data_rec.data = data;
                    msg.hook = gatts->gattsEventProcessedHook;
                    msg.hookContext = gatts;
                    BleObject::getInstance().dispatcher()->enqueue(msg);
                } else {
                    LOG(ERROR, "Allocate memory for received data failed.");
                }
            }
            break;
        }
        case BLE_GATTS_EVT_HVN_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: notification sent.");
            if (gatts->hvxSemaphore_) {
                os_semaphore_give(gatts->hvxSemaphore_, false);
            }
            break;
        }
        case BLE_GATTS_EVT_HVC: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: indication confirmed.");
            if (gatts->hvxSemaphore_) {
                os_semaphore_give(gatts->hvxSemaphore_, false);
            }
            break;
        }
        case BLE_GATTS_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: timeout, source: %d.", event->evt.gatts_evt.params.timeout.src);
            // Disconnect on GATT Server timeout event.
            int ret = sd_ble_gap_disconnect(event->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
            break;
        }
        default: {
            break;
        }
    }
}

struct GattClientImpl {
    BleObject::GattClient* instance;
};
static GattClientImpl gattcImpl;

int BleObject::GattClient::init() {
    if (!gattcDataRecPoolInit_) {
        CHECK(gattcDataRecPool_.init(GATT_CLIENT_DATA_REC_POOL_SIZE));
        gattcDataRecPoolInit_ = true;
    }
    if (!gattcDiscPoolInit_) {
        CHECK(gattcDiscPool_.init(GATT_CLIENT_DISC_SVC_CHAR_POOL_SIZE));
        gattcDiscPoolInit_ = true;
    }
    gattcImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleGattClient, 1, processGattClientEvents, &gattcImpl);
    gattcInitialized_ = true;
    return SYSTEM_ERROR_NONE;
}

