particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
bool BleObject::GattClient::discovering(hal_ble_conn_handle_t connHandle) const {
    // TODO: discovering service and characteristic on multi-links concurrently.
    return isDiscovering_;
}

int BleObject::GattClient::discoverServices(hal_ble_conn_handle_t connHandle, const hal_ble_uuid_t* uuid, hal_ble_on_disc_service_cb_t callback, void* context) {
    int ret;
    if (!BleObject::getInstance().connMgr()->valid(connHandle)) {
        LOG(ERROR, "Connection invalid.");
        return SYSTEM_ERROR_NOT_FOUND;
    }
    if (isDiscovering_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (os_semaphore_create(&discoverySemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD ({
        resetDiscoveryState();
        auto sem = discoverySemaphore_;
        discoverySemaphore_ = nullptr;
        os_semaphore_destroy(sem);
    });
    currDiscConnHandle_ = connHandle;
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_SERVICES;
    if (uuid == nullptr) {
        discoverAll_ = true;
        ret = sd_ble_gattc_primary_services_discover(connHandle, SERVICES_BASE_START_HANDLE, nullptr);
    } else {
        ble_uuid_t svcUUID;
        BleObject::toPlatformUUID(uuid, &svcUUID);
        ret = sd_ble_gattc_primary_services_discover(connHandle, SERVICES_BASE_START_HANDLE, &svcUUID);
    }
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    isDiscovering_ = true;
    if (os_semaphore_take(discoverySemaphore_, BLE_DICOVERY_PROCEDURE_TIMEOUT_MS, false)) {
        return SYSTEM_ERROR_TIMEOUT;
    }
    hal_ble_svc_t* services = (hal_ble_svc_t*)malloc(discServiceCount_ * sizeof(hal_ble_svc_t));
    if (services) {
        //LOG_DEBUG(TRACE, "Discovered services address: %u, len: %u", (unsigned)services, discServiceCount_ * sizeof(hal_ble_svc_t));
        BleObject::BleEventDispatcher::EventMessage msg;
        msg.evt.type = BLE_EVT_SVC_DISCOVERED;
        msg.evt.version = BLE_API_VERSION;
        msg.evt.size = sizeof(hal_ble_evts_t);
        msg.evt.params.svc_disc.conn_handle = currDiscConnHandle_;
        msg.evt.params.svc_disc.count = discServiceCount_;
        DiscoveredService* discService = nullptr;
        size_t i = 0;
        do {
            discService = discServicesList_.popFront();
            if (discService) {
                memcpy(services + i, &discService->service, sizeof(hal_ble_svc_t));
                i++;
                DiscoveredService* curr = discService;
                gattcDiscPool_.free(curr);
            }
        } while (discService);
        msg.evt.params.svc_disc.services = services;
        msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)callback;
        msg.context = context;
        msg.hook = gattcEventProcessedHook;
        msg.hookContext = this;
        return BleObject::getInstance().dispatcher()->enqueue(msg);
    } else {
        LOG(ERROR, "Allocate memory for discovered services failed.");
        return SYSTEM_ERROR_NO_MEMORY;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattClient::discoverCharacteristics(hal_ble_conn_handle_t connHandle, const hal_ble_svc_t* service, hal_ble_on_disc_char_cb_t callback, void* context) {
    if (!BleObject::getInstance().connMgr()->valid(connHandle)) {
        LOG(ERROR, "Connection invalid.");
        return SYSTEM_ERROR_NOT_FOUND;
    }
    if (isDiscovering_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (os_semaphore_create(&discoverySemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD ({
        resetDiscoveryState();
        auto sem = discoverySemaphore_;
        discoverySemaphore_ = nullptr;
        os_semaphore_destroy(sem);
    });
    ble_gattc_handle_range_t handleRange = {};
    handleRange.start_handle = service->start_handle;
    handleRange.end_handle = service->end_handle;
    currDiscConnHandle_ = connHandle;
    currDiscSvc_ = *service;
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS;
    int ret = sd_ble_gattc_characteristics_discover(connHandle, &handleRange);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    isDiscovering_ = true;
    if (os_semaphore_take(discoverySemaphore_, BLE_DICOVERY_PROCEDURE_TIMEOUT_MS, false)) {
        return SYSTEM_ERROR_TIMEOUT;
    }
    // Now discover characteristic descriptors
    CHECK_TRUE(BleObject::getInstance().connMgr()->valid(connHandle), SYSTEM_ERROR_NOT_FOUND);
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_DESCRIPTORS;
    ret = sd_ble_gattc_descriptors_discover(currDiscConnHandle_, &handleRange);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    if (os_semaphore_take(discoverySemaphore_, BLE_DICOVERY_PROCEDURE_TIMEOUT_MS, false)) {
        return SYSTEM_ERROR_TIMEOUT;
    }
    hal_ble_char_t* characteristics = (hal_ble_char_t*)malloc(discCharacteristicCount_ * sizeof(hal_ble_char_t));
    if (characteristics) {
        //LOG_DEBUG(TRACE, "Discovered characteristics address: %u, len: %u", (unsigned)characteristics, discCharacteristicCount_ * sizeof(hal_ble_char_t));
        BleObject::BleEventDispatcher::EventMessage msg;
        msg.evt.type = BLE_EVT_CHAR_DISCOVERED;
        msg.evt.version = BLE_API_VERSION;
        msg.evt.size = sizeof(hal_ble_evts_t);
        msg.evt.params.char_disc.conn_handle = currDiscConnHandle_;
        msg.evt.params.char_disc.count = discCharacteristicCount_;
        DiscoveredCharacteristic* discChar = nullptr;
        size_t i = 0;
        do {
            discChar = discCharacteristicsList_.popFront();
            if (discChar) {
                memcpy(characteristics + i, &discChar->characteristic, sizeof(hal_ble_char_t));
                i++;
                DiscoveredCharacteristic* curr = discChar;
                gattcDiscPool_.free(curr);
            }
        } while (discChar);
        msg.evt.params.char_disc.characteristics = characteristics;
        msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)callback;
        msg.context = context;
        msg.hook = gattcEventProcessedHook;
        msg.hookContext = this;
        return BleObject::getInstance().dispatcher()->enqueue(msg);
    } else {
        LOG(ERROR, "Allocate memory for discovered characteristics failed.");
        return SYSTEM_ERROR_NO_MEMORY;
    }
    return SYSTEM_ERROR_NONE;
}

ssize_t BleObject::GattClient::writeAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len, bool response) {
    if (buf == nullptr || len == 0) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (!BleObject::getInstance().connMgr()->valid(connHandle)) {
        LOG(ERROR, "Connection invalid.");
        return SYSTEM_ERROR_NOT_FOUND;
    }
    ble_gattc_write_params_t writeParams;
    if (os_semaphore_create(&readWriteSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD ({
        auto sem = readWriteSemaphore_;
        readWriteSemaphore_ = nullptr;
        os_semaphore_destroy(sem);
    });
    if (response) {
        writeParams.write_op = BLE_GATT_OP_WRITE_REQ;
    } else {
        writeParams.write_op = BLE_GATT_OP_WRITE_CMD;
    }
    len = std::min(len, (size_t)BLE_ATTR_VALUE_PACKET_SIZE(BleObject::getInstance().connMgr()->getAttMtu(connHandle)));
    writeParams.flags = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;
    writeParams.handle = attrHandle;
    writeParams.offset = 0;
    writeParams.len = len;
    writeParams.p_value = buf;
    int ret = sd_ble_gattc_write(connHandle, &writeParams);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    if (os_semaphore_take(readWriteSemaphore_, BLE_READ_WRITE_PROCEDURE_TIMEOUT_MS, false)) {
        return SYSTEM_ERROR_TIMEOUT;
    }
    return len;
}

// FIXME: Multi-link read
ssize_t BleObject::GattClient::readAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, uint8_t* buf, size_t len) {
    if (buf == nullptr || len == 0) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (!BleObject::getInstance().connMgr()->valid(connHandle)) {
        LOG(ERROR, "Connection invalid.");
        return SYSTEM_ERROR_NOT_FOUND;
    }
    if (os_semaphore_create(&readWriteSemaphore_, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    SCOPE_GUARD ({
        readBuf_ = nullptr;
        readAttrHandle_ = BLE_INVALID_ATTR_HANDLE;
        auto sem = readWriteSemaphore_;
        readWriteSemaphore_ = nullptr;
        os_semaphore_destroy(sem);
    });
    readAttrHandle_ = attrHandle;
    readBuf_ = buf;
    readLen_ = std::min(len, (size_t)BLE_ATTR_VALUE_PACKET_SIZE(BleObject::getInstance().connMgr()->getAttMtu(connHandle)));
    int ret = sd_ble_gattc_read(connHandle, attrHandle, 0);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    if (os_semaphore_take(readWriteSemaphore_, BLE_READ_WRITE_PROCEDURE_TIMEOUT_MS, false)) {
        return SYSTEM_ERROR_TIMEOUT;
    }
    return readLen_;
}

void BleObject::GattClient::resetDiscoveryState() {
    discoverAll_ = false;
    isDiscovering_ = false;
    currDiscConnHandle_ = BLE_INVALID_CONN_HANDLE;
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_IDLE;
    discServiceCount_ = 0;
    discCharacteristicCount_ = 0;
    DiscoveredService* discService = nullptr;
    DiscoveredCharacteristic* discChar = nullptr;
    do {
        discService = discServicesList_.popFront();
        if (discService) {
            DiscoveredService* curr = discService;
            gattcDiscPool_.free(curr);
        }
    } while (discService);
    do {
        discChar = discCharacteristicsList_.popFront();
        if (discChar) {
            DiscoveredCharacteristic* curr = discChar;
            gattcDiscPool_.free(curr);
        }
    } while (discChar);
}

int BleObject::GattClient::addDiscoveredService(const hal_ble_svc_t& service) {
    DiscoveredService* discService = (DiscoveredService*)gattcDiscPool_.alloc(sizeof(DiscoveredService));
    if (discService) {
        discService->service = service;
        discServicesList_.pushFront(discService);
        discServiceCount_++;
        return SYSTEM_ERROR_NONE;
    } else {
        LOG(ERROR, "Allocate memory for discovered services failed.");
    }
    return SYSTEM_ERROR_NO_MEMORY;
}

int BleObject::GattClient::addDiscoveredCharacteristic(const hal_ble_char_t& characteristic) {
    DiscoveredCharacteristic* discChar = (DiscoveredCharacteristic*)gattcDiscPool_.alloc(sizeof(DiscoveredCharacteristic));
    if (discChar) {
        discChar->characteristic = characteristic;
        discCharacteristicsList_.pushFront(discChar);
        discCharacteristicCount_++;
        return SYSTEM_ERROR_NONE;
    } else {
        LOG(ERROR, "Allocate memory for discovered characteristics failed.");
    }
    return SYSTEM_ERROR_NO_MEMORY;
}

bool BleObject::GattClient::readServiceUUID128IfNeeded() const {
    auto discService = discServicesList_.front();
    while (discService) {
        if (discService->service.uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
            return (sd_ble_gattc_read(currDiscConnHandle_, discService->service.start_handle, 0) == NRF_SUCCESS);
        }
        discService = discService->next;
    }
    return false;
}

